var roster = [
	{"name":"Sam Letcher", "year":"Junior", "height":"6'3", "ultimateExperience":"Northampton HS 1 year, U-19 BUDA YCCs 2 years, Boston Lions 2 years", "bio":"Sam started 'playing' Ultimate at the tender age of like... 6. [citiation needed] See, his father was one of those weird dudes who played in college back in the prehistoric era of the early 80's. Sam is currently disappointing him on the field by getting burned deep, turfing easy throws and dropping hucks. Sorry Dad."}
	{"name":"Brian 'BBQ' Wyer", "year":"Junior", "height":"6'1", "ultimateExperience":"Risky Business (DFW)", "bio":"BBQ is a pure athlete. His self-confidence can be troublesome when he attempts feats no human could possibly withstand. He ran a 74.2 second 400M dash in 2009 and his hero is Bo Jackson. Some day he plans to take Taylor Swift on a lunch date."}
	{"name":"Sam 'Tinder' Therrien", "year":"Senior", "height":"5'9", "ultimateExperience":"St John's Prep, Salem State Ultimate, NU Ultimate", "bio":"Sam is the oldest active member of the NU Ultimate Team. He likes to have fun but is also competitive and is state-mandated to wear a helmet at all times for his own safety. Sam dislikes his nickname but embraces it anyways. Sam also likes to think he is dating professional ski racers Lindsey Vonn and Mikaela Shiffrin."}
	{"name":"Liam Henry", "year":"Middler", "height":"6'0", "ultimateExperience":"Founder of GDRHS Ultimate, BUDA League with GrassStains, U19 Mixed YCCs with BUDA and two years club with Reading Rainbow.", "bio":"Liam has been known to handle, puke at practice and yell at people for throwing shitty hucks. His goals for the coming season are running the dump set and prioritizing Ultimate over Spikeball."}
	{"name":"Alexander Evan Soltoff", "year":"Senior", "height":"1.81 meters", "ultimateExperience":"Newton South High School Angry Corn. Northeastern Huskies A&B, Maties (pronounced mah-tees)", "bio":"Alex started playing competitive Ultimate at the age of 14 for the Newton South Angry Corn, captaining them to a 2nd place finish at States and multiple spirit awards. Upon starting college, Salty made an immediate impact for the Huskies. The bag items 'Lick Salty' and 'Kiss Salty' are staples of any party worth remembering. His goals in life are to sweat and to defeat the Elite Four, finally sticking it to his rival Gary and proving to Professor Oak that he is the true son of Pallet Town."}
	{"name":"Jonah Kurman-Faber", "year":"Junior", "height":"5'11", "ultimateExperience":"Sharon High School, Northeastern University", "bio":"Jonah was born at the bottom of Lake Massapoag and raised by Smallmouth bass until the age of 12. In 1998, he violently threw a garbage can lid out of frustration during an argument with Brian Wyer about minimum wage. Hence, his love for frisbee was born. Since then he has collected an admirable array of accolades, such as Summer 2012 when he threw a frisbee over 30 yards."}
	{"name":"Chris McKenna", "year":"Sophomore", "height":"5'7", "ultimateExperience":"Andover Golden Gophers, Desert Horizon, Northeastern Men's Ultimate", "bio":"He's half Canadian and half Asian. So that's kinda cool I guess."}
	{"name":"John 'Cap' Capreol", "year":"Senior", "height":"5'9", "ultimateExperience":"Going on his 5th year playing with the Northeastern Huskies A Team (hopefully).", "bio":"Cap started his Ultimate career as a part of this team at Northeastern.  Coming in as a first year he didn't know what to expect from playing on an organized Ultimate team, but over the years he has continued to improve upon his skills which started from basically nothing.  While a solid player, he still likes to make his casual mistakes on and off the field and its generally stated that he's an all around bad person. We tolerate him....."}
	{"name":"Yeehin Lee", "year":"Middler", "height":"5'6", "ultimateExperience":"Northeastern Ultimate, Needham Ultimate", "bio":"Yeehin is a 3rd year Mechanical Engineering major from Needham, MA. He started playing ultimate sophomore year of high school when his friend literally dragged him to tryouts. Yeehin is mainly a cutter but has had some handling experience. Also note that if you hear some crazy squeaking chasing after you on the field, it's most likely him and his knee brace barreling after you."}
	{"name":"Justin Tran", "year":"Sophomore", "height":"6'", "ultimateExperience":"Hunter Halcyons, YCC Mixed - New York Skyscrapers, Northeastern Huskies", "bio":"After playing ultimate for five years, Justin is grateful for the opportunity to be a rookie again and grow with a team that has so much skill and potential. Justin is used to a hectic life with two dogs, two cats, and a crazy family filling his house in Brooklyn, New York. In his spare time, he loves to read legal thrillers, play ultimate, and watch sitcoms. Don't be afraid to say hi; he also loves to meet new people."}
	{"name":"Sumner Cushman", "year":"Sophomore", "height":"5'10", "ultimateExperience":"Ashland High School, Reading Rainbow, Desert Horizon, Northeastern A team", "bio":"Currently a Sophomore majoring in Chemical Engineering. I live in fear of the day I find someone who is better than me at both Ultimate and Super Smash Brothers."}
	{"name":"Matt Dowgialo", "year":"Graduate", "height":"6'0", "ultimateExperience":"St. John's Prep Eagles, 4 years, Le Moyne College Green Goblins, 4 years, Northeastern Huskies, 1 year", "bio":"Matt started playing ultimate in high school in Danvers, MA at St. John's Prep high school. He organized the first frisbee team at Le Moyne College in Syracuse and named the team after his favorite super-villain. Starting grad school at NEU, he finished his last year of eligibility with the Huskies as team dad. Matt enjoys playing basketball, running 5K's, country music, and eating thai and mexican food."}
	{"name":"Justin Wong", "year":"Middler", "height":"6'0", "ultimateExperience":"Stuyvesant Sticky Fingers, Revolution, Bearfoot", "bio":"I'm a vegetarian and I make team dinners a pain."}
	{"name":"Ben Goosen", "year":"Middler", "height":"6'2", "ultimateExperience":"Monarch Coyotes 2010-2013, Northeastern Huskies 2014-current, Lions 2015-current", "bio":"Louisville, Colorado born and raised. Goose is inspired by athletes Uncle Drew and Chad Ochocinco and can frequently be heard shouting phrases like 'child please', 'don't reach youngblood', and 'do it for Madden' out on the field. Known for his freak athleticism, he does in fact have a need for speed. Fun Fact: Handler because white people love assists"}
	{"name":"Alex Chao", "year":"Junior", "height":"5'6", "ultimateExperience":"Stuyvesant Sticky Fingers", "bio":"Alex Chao is a feisty speed demon who has many tricks up his sleeve. A versatile handler, Chao twists and befuddles marks as he chews up defenses. He would ride his bike to tourneys if he could, just to leave you in the dust with his remaining energy."}
	{"name":"Jesse Harris", "year":"Senior", "height":"5'10", "ultimateExperience":"Amherst High School, Dark or Light", "bio":"Jesse Harris is a well fit lad who began playing Ultimate many many years ago. He comes from the disc stronghold of Amherst, MA and continues to make his followers proud. A handler by trade, cutter by birth, this groomed athlete can do it all. On game day, practice day, and every day, he motivates his teammates and expects the most out of his peers."}
	{"name":"Ilya Yudkovich", "year":"Sophomore", "height":"5'8", "ultimateExperience":"BU Academy, Desert Horizon, Reading Rainbow", "bio":"Ilya Yudkovich is a sophomore Ultimate player who somehow missed the open concept of Glasnost. He has great things to say if you can past his Russian barrier of silence. A student of the game, Ilya has an strong impact on the line wherever you put him with mountains of future potential."}
	{"name":"Ben Meltzer", "year":"Junior", "height":"5'9", "ultimateExperience":"Puget Sound", "bio":"Benjamin Meltzer is a vegan boy from Washington state. He travels by backpack or by thumb and has amazing 'throw and go' quickness. Ben is a force to be reckoned with at the handler position due to his distributive abilities. His hands are great, and only improving through his practices in the ASL Finger Dexterity program"}
	{"name":"Jon Aldieri", "year":"Graduate", "height":"5'5", "ultimateExperience":"Northeastern Huskies", "bio":"	Jon Aldieri is an energetic motivator for life's everyday tasks. When he is placed on a field with talented individuals looking up to him, he brings the absolute best out of everyone. Jon has speed that kills, jukes that deceive, and a smile to melt your heart. You can find him at the park, critiquing the shrubbery, or impressing women with his quick release flick huck."}
	{"name":"Sean Farrel", "year":"Graduate", "height":"6'1", "ultimateExperience":"The Ghosts, Boston Lionside", "bio":"Sean Farrell is a driven and unquestionably talented athlete.  Big #13 may steal your favorite number, but he will make sure the number stays noticed on the field.  A go-getting in the red zone, Sean strives to break down his opponents and celly on their graves."}
	{"name":"Mattew Grote", "year":"Graduate", "height":"5'7", "ultimateExperience":"Northeastern Huskies", "bio":"Mathew Grote is a cutter who plays off of pure instinct. His well tuned body consists of yoga, coffee and fine wines. These components equate to a speedy cutter with hands that can also pull of nifty throws. Not afraid of contact, Grote gives you the heart and longevity that is essential in the D1 College Ultimate game."}
]